app/Models/DataModel.php

SELECT *
FROM `data`
WHERE `id` IS NULL
 LIMIT 1
---
    public function getDataById($id) {
        parent::__construct();
        return $this->where('id', $id)->first();