app/Models/LocationModel.php

SELECT *
FROM `locations`
WHERE `id` = '176'
 LIMIT 1
---
    public function getLocationById($id) {
        parent::__construct();
        return $this->where('id', $id)->first();

INSERT INTO `locations` (`countryCode`, `city`) VALUES ('US', 'Troutman')
---
    public function saveLocation($data) {
        if($this->getLocation($data)) {
            return $this->getLocation($data)['id'];
        }

        $this->save($data);