app/Models/MessageModel.php

SELECT *
FROM `messages`
WHERE `jsonfileId` = 'be836100-b6cf-11ed-815f-e782aada14c3'
---
    public function getMessagesByJson($id) {
        parent::__construct();
        $query = $this->where('jsonfileId', $id);
        return $query->get()->getResult();

SELECT *
FROM `messages`
WHERE `jsonfileId` = 'be836100-b6cf-11ed-815f-e782aada14c3'
---
    public function getAllFileDataById($id) {
        $dataModel = new DataModel();
        $query = $this->where('jsonfileId', $id);
        $messages = $query->get()->getResult();

SELECT *
FROM `messages`
WHERE `jsonfileId` = 'be836100-b6cf-11ed-815f-e782aada14c3'
---
    public function getAllSendersById($id) {
        $senderModel = new SenderModel();
        $query = $this->where('jsonfileId', $id);
        $messages = $query->get()->getResult();

INSERT INTO `messages` (`senderId`, `type`, `time`, `msg`, `jsonfileId`, `dataId`) VALUES ('158', 'msg', '2023-02-23 18:38:51', 'Thank you for visiting CS3337. Our customer support team is available online now to answer your questions on our complete line of performance products.', '3dd04e20-b3a9-11ed-b8d1-1de2c7e3e2f1', NULL)
---
                'dataId' => $dataId
            ];

            $this->save($data);