app/Models/SenderModel.php

    public function getSenderById($id) {
        parent::__construct();
        return $this->where('id', $id)->first();
---
SELECT *
FROM `senders`
WHERE `id` = '158'
 LIMIT 1

    public function saveSender($data) {
        $this->save($data);
---
INSERT INTO `senders` (`t`, `n`) VALUES ('a', 'Steve Darrow')

    public function getSender($sender) {
        parent::__construct();
        return $this->where($sender)->first();
---
SELECT *
FROM `senders`
WHERE `t` = 'a'
AND `n` = 'Mathew'
 LIMIT 1