app/Models/VisitorModel.php

SELECT *
FROM `visitors`
WHERE `id` = '6217dc581ffac05b1d7b96d4-wLldyhFpClz8J7CeChMyt'
 LIMIT 1
---
    public function getVisitorById($id) {
        parent::__construct();
        return $this->where('id', $id)->first();